Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/government_in_ireland/elections_and_referenda/european_elections/index.html.txt.tmx
Source language: en
Languages: ga

source: Direct elections to the European Parliament take place every 5 years throughout the European Union
ga: Reáchtáiltear toghcháin dhíreacha do Pharlaimint na hEorpa gach 5 bliana ar fud an Aontais Eorpaigh

source: Voting procedure in a European election
ga: An Córas Vótála do Thoghchán Eorpach

source: Explanation of the system of voting in an election to the European Parliament
ga: Tá cur síos sa cháipéis seo ar an gcóras vótála atá i bhfeidhm le toghchán le Pharlaimint na hEorpa

source: Eligibility for Membership of the European Parliament
ga: Intofa mar bhall de Pharlaimint na hEorpa

source: To be eligible for membership of the European Parliament, you must fulfil certain criteria
ga: Le bheith intofa mar bhall de Pharlaimint na hEorpa, caithfidh tú critéir áirithe a shásamh

source: Find out whether you might be eligible and why some people are disqualified
ga: Faigh amach más féidir leat bheith cáilithe agus cén fáth nach gcáilíonn daoine áirithe

source: Nomination of Candidates for election to the European Parliament
ga: Iarrthóirí a ainmniú do bhallraíocht i bParlaimint na hEorpa

source: How to nominate someone else or be nominated for election to the European Parliament
ga: Tá cur síos sa cháipéis seo ar chonas ainmniúchán a fháil mar iarrthóir i dtoghchán Pharlaimint na hEorpa

source: Replacement Candidates for the European Parliament
ga: Ath-Iarrthóirí do Pharlaimint na hEorpa

source: If a Member of the European Parliament (MEP) resigns or dies, their vacancy is filled from a replacement list of eligible candidates
ga: Má chailltear Feisire Eorpach nó má éiríonn sé/sí as oifig, líontar an folúntas ó liosta ionaid iarrthóirí incháilithe

source: European elections - counting the votes
ga: Toghcháin Eorpacha- na vótaí a chomhaireamh

source: How your vote is counted in an election to the European Parliament
ga: Tá cur síos sa cháipéis seo ar an gcóras le vótaí a chomhaireamh i dtoghchán do Pharlaimint na hEorpa

source: European elections - alternative voting arrangements
ga: Toghcháin Eorpacha - socruithe eile vótála

source: Alternative voting arrangements that are place to facilitate elections to the European Parliament
ga: Tá cur síos sa cháipéis seo ar na socruithe eile vótála atá i bhfeidhm do thoghcháin Pharlaimint na hEorpa

source: Most Read in "Government in Ireland"
ga: Ábhar is mó éilimh i "Rialtas in Éirinn"

source: Fundamental Rights under the Irish Constitution
ga: Bunchearta faoi Bhunreacht na hÉireann
